#### BuiltInFailures.WallJoinRoofFailures Members

---

|  |
| --- |
| BuiltInFailures WallJoinRoofFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures WallJoinRoofFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | NoFromRoofForWall | Highlighted wall is set to be "From roof", however there is no roof below it that can be used. |
| Public property Static member | NotCoveredAtAllByTarget | Highlighted walls are attached to, but miss, the highlighted targets. |
| Public property Static member | NoUptoRoofForWall | Highlighted wall is set to be "Up to roof", however there is no roof above it that can be used. |
| Public property Static member | WallMeetsRoofTangentially | The highlighted wall cannot be joined to the highlighted roof because the wall meets the roof tangentially. |
| Public property Static member | WallNotCoveredByRoof | The highlighted wall(s) cannot be joined to the highlighted roof because the roof does not entirely cover the wall(s). |

# See Also

BuiltInFailures WallJoinRoofFailures Class

Autodesk.Revit.DB Namespace